In [1]:
import pandas as pd
from joblib import load,dump
import statistics

In [2]:
################### Here we need to load Data used for creating model, if model was creates by insdustrialPipeline.py,
################### extract data from bdd as csv first
predf = pd.read_csv('Base_Files/house_ligth.csv', index_col =0)

In [3]:
predf.sample(3)

,id,type_de_bien,année,nb_de_pieces,surface,ville,prix
1349,2738,appartement,2006.0,3,41,LE VERDON SUR MER,95400
2846,2321,appartement,NaN,3,35,LE VERDON SUR MER,65000
2397,1407,maison,NaN,3,76,ARES,318000

In [4]:
count = 0
for i in predf["ville"]:
    predf.loc[count,"p_m2"] = predf.loc[count,"prix"]/predf.loc[count,"surface"]
    count +=1

In [5]:
predf.sample(3)

,id,type_de_bien,année,nb_de_pieces,surface,ville,prix,p_m2
436,902,maison,1972.0,6,116,SABLONS,123000,1060.344828
2742,2106,maison,NaN,8,245,LIBOURNE,575000,2346.938776
1623,3378,maison,1976.0,6,125,GUJAN MESTRAS,445000,3560.000000

In [6]:
df = pd.DataFrame(predf, columns=["ville","p_m2"])

In [7]:
df['ville'] = df['ville'].str.strip() #Correction du premier charactère == " ".

In [8]:
df.sample(3)

              ville         p_m2
297   LACANAU OCEAN  3133.333333
1832       BORDEAUX  4835.526316
555        ARCACHON  8115.625000

In [9]:
#### change number by model version before extract ####
name_joblib = "dataBrick_for_v3.joblib"
dump(df,name_joblib)

['dataBrick_for_v3.joblib']

# Testing the Joblib

In [10]:
df = load(name_joblib)

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.sample(5)

                   ville         p_m2
941   ST ANDRE DE CUBZAC  1725.524476
370            PUYBARBAN  1543.750000
2829            BORDEAUX  4816.326531
3019            LA REOLE   915.740741
2790             BOULIAC  3918.750000

In [15]:
def dataAn(input_ville):
    """ pass here the request input for ville by user on api,
    return input for p_m2 as k5 and niv_confidence as str to display on the ui"""
    
    df = load("dataBrick_for_v3.joblib")
    k4 = input_ville
    sclol = df[df['ville'].isin([f"{k4}"])]
    if len(sclol) < 4 :
        niv_confidence = "Faible, l'Ia connait peut cette ville"
    elif len(sclol) >3 and len(sclol) <10 : 
        niv_confidence = "Normal, l'Ia connait cette ville, mais manque un peu d'information"
    elif len(sclol) >=10 : 
        niv_confidence = "Forte, l'Ia connait bien cette ville"

    if len(sclol) != 0 :
        k5 = statistics.mean(sclol["p_m2"])
    else :
        niv_confidence = "Faible, l'Ia connait pas cette ville"
        k5 = statistics.mean(df["p_m2"])
        
    return k5, niv_confidence

In [16]:
info1, info2 = dataAn("BORDEAUX") ### attention ici l'espace devant la ville est pas géré ds la pipeline oui.

In [17]:
print(info1) ## this print is jut for example don't display it on UI
print(info2)

4892.197159764299
Forte, l'Ia connait bien cette ville

In [20]:
sclol = df[df['ville'].isin(["LE HAILLAN"])]
sclol

           ville         p_m2
677   LE HAILLAN  3671.140940
741   LE HAILLAN  4666.666667
917   LE HAILLAN  2954.000000
1127  LE HAILLAN  2792.592593
1510  LE HAILLAN  3844.491525
1707  LE HAILLAN  3579.545455
1726  LE HAILLAN  3604.651163
1858  LE HAILLAN  3636.809816
2131  LE HAILLAN  3927.350427
2448  LE HAILLAN  3522.727273
2460  LE HAILLAN  3023.809524
3446  LE HAILLAN  3611.445783